app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("first_name", "last_name", "number", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "forrest"], ["last_name", "gump"], ["number", "17072309768"], ["user_id", 3], ["created_at", "2016-02-15 04:16:11.956939"], ["updated_at", "2016-02-15 04:16:11.956939"]]
---
  def create

    @contact = Contact.new(first_name: params[:contact][:first_name], last_name: params[:contact][:last_name], number: params[:contact][:number], user_id: current_user.id)
    if @contact.save