app/controllers/users_controller.rb

  def index
    @users = User.order(:last_name)
---
SELECT "users".* FROM "users"  ORDER BY "users"."last_name" ASC

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 13]]
UPDATE "users" SET "first_name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "Dave"], ["password_digest", "$2a$10$otysmprwi88lj13jriWOxOL0UOiLj3qSGqq9kbiEb8leEkqqVK.Ou"], ["updated_at", "2016-02-14 07:24:58.971655"], ["id", 13]]