app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 1
---
  def index
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT 1
---
  def edit
    @user = User.find_by(email: params[:email])